# YOLO11s-seg 网络结构配置
# 格式: [from, repeats, module, args]
# from: -1 表示上一层, 数字表示对应层索引, 列表表示多层concat

# 类别定义
# 0: person, 1: robot, 2: car
nc: 3

# 数据集来源定义 (用于loss屏蔽)
# coco_source: 只有 person(0) 和 car(2), 不计算 robot(1) 的loss
# robot_source: 只有 robot(1), 不计算 person(0)/car(2) 的预测loss
dataset_sources:
  coco: [0, 2]      # coco数据集包含的类别id
  robot: [1]        # 机器人数据集包含的类别id

# s scale: depth=0.50, width=0.50, max_channels=1024
scales:
  s: [0.50, 0.50, 1024]

scale: s  # 当前使用的scale

# Backbone
# [from, repeats, module, args]
backbone:
  - [-1, 1, Conv,  [64, 3, 2]]          # 0  P1/2   3->32
  - [-1, 1, Conv,  [128, 3, 2]]         # 1  P2/4   32->64
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2         64->128
  - [-1, 1, Conv,  [256, 3, 2]]         # 3  P3/8   128->128
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4         128->256
  - [-1, 1, Conv,  [512, 3, 2]]         # 5  P4/16  256->256
  - [-1, 2, C3k2,  [512, True]]         # 6         256->256
  - [-1, 1, Conv,  [1024, 3, 2]]        # 7  P5/32  256->512
  - [-1, 2, C3k2,  [1024, True]]        # 8         512->512
  - [-1, 1, SPPF,  [1024, 5]]           # 9         512->512
  - [-1, 2, C2PSA, [1024]]              # 10        512->512

# Head (FPN + PAN)
head:
  - [-1,      1, Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat,   [1]]                   # 12 cat P4 (512+256=768->...)
  - [-1,      2, C3k2,     [512, False]]           # 13

  - [-1,      1, Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat,   [1]]                   # 15 cat P3 (256+256=512->...)
  - [-1,      2, C3k2,     [256, False]]           # 16 P3/8-small

  - [-1,       1, Conv,    [256, 3, 2]]            # 17
  - [[-1, 13], 1, Concat,  [1]]                   # 18 cat P4
  - [-1,       2, C3k2,    [512, False]]           # 19 P4/16-medium

  - [-1,       1, Conv,    [512, 3, 2]]            # 20
  - [[-1, 10], 1, Concat,  [1]]                   # 21 cat P5
  - [-1,       2, C3k2,    [1024, True]]           # 22 P5/32-large

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]      # 23 Segment head

# 训练超参
hyp:
  box: 7.5
  cls: 0.5
  dfl: 1.5
  overlap_mask: true
  mask_ratio: 4
